Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxLmu_reg.h
/** \brief 100, LMU Region Lower Address Register */
#define LMU0_RGN11_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100100u)
/** Alias (User Manual Name) for LMU0_RGN11_LA.
* To use register names with standard convension, please use LMU0_RGN11_LA.
*/
#define LMU0_RGNLA11 (LMU0_RGN11_LA)

/** \brief 104, LMU Region Upper Address Register */
#define LMU0_RGN11_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100104u)
/** Alias (User Manual Name) for LMU0_RGN11_UA.
* To use register names with standard convension, please use LMU0_RGN11_UA.
*/
#define LMU0_RGNUA11 (LMU0_RGN11_UA)

/** \brief 108, LMU Region Write Access Enable Register A */
#define LMU0_RGN11_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100108u)
/** Alias (User Manual Name) for LMU0_RGN11_ACCENA.
* To use register names with standard convension, please use LMU0_RGN11_ACCENA.
*/
#define LMU0_RGNACCENWA11 (LMU0_RGN11_ACCENA)

/** \brief 10C, LMU Region Write Access Enable Register B */
#define LMU0_RGN11_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810010Cu)
/** Alias (User Manual Name) for LMU0_RGN11_ACCENB.
* To use register names with standard convension, please use LMU0_RGN11_ACCENB.
*/
#define LMU0_RGNACCENWB11 (LMU0_RGN11_ACCENB)

/** \brief 110, LMU Region Lower Address Register */
#define LMU0_RGN12_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100110u)
/** Alias (User Manual Name) for LMU0_RGN12_LA.
* To use register names with standard convension, please use LMU0_RGN12_LA.
*/
#define LMU0_RGNLA12 (LMU0_RGN12_LA)

/** \brief 114, LMU Region Upper Address Register */
#define LMU0_RGN12_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100114u)
/** Alias (User Manual Name) for LMU0_RGN12_UA.
* To use register names with standard convension, please use LMU0_RGN12_UA.
*/
#define LMU0_RGNUA12 (LMU0_RGN12_UA)

/** \brief 118, LMU Region Write Access Enable Register A */
#define LMU0_RGN12_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100118u)
/** Alias (User Manual Name) for LMU0_RGN12_ACCENA.
* To use register names with standard convension, please use LMU0_RGN12_ACCENA.
*/
#define LMU0_RGNACCENWA12 (LMU0_RGN12_ACCENA)

/** \brief 11C, LMU Region Write Access Enable Register B */
#define LMU0_RGN12_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810011Cu)
/** Alias (User Manual Name) for LMU0_RGN12_ACCENB.
* To use register names with standard convension, please use LMU0_RGN12_ACCENB.
*/
#define LMU0_RGNACCENWB12 (LMU0_RGN12_ACCENB)

/** \brief 120, LMU Region Lower Address Register */
#define LMU0_RGN13_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100120u)
/** Alias (User Manual Name) for LMU0_RGN13_LA.
* To use register names with standard convension, please use LMU0_RGN13_LA.
*/
#define LMU0_RGNLA13 (LMU0_RGN13_LA)

/** \brief 124, LMU Region Upper Address Register */
#define LMU0_RGN13_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100124u)
/** Alias (User Manual Name) for LMU0_RGN13_UA.
* To use register names with standard convension, please use LMU0_RGN13_UA.
*/
#define LMU0_RGNUA13 (LMU0_RGN13_UA)

/** \brief 128, LMU Region Write Access Enable Register A */
#define LMU0_RGN13_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100128u)
/** Alias (User Manual Name) for LMU0_RGN13_ACCENA.
* To use register names with standard convension, please use LMU0_RGN13_ACCENA.
*/
#define LMU0_RGNACCENWA13 (LMU0_RGN13_ACCENA)

/** \brief 12C, LMU Region Write Access Enable Register B */
#define LMU0_RGN13_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810012Cu)
/** Alias (User Manual Name) for LMU0_RGN13_ACCENB.
* To use register names with standard convension, please use LMU0_RGN13_ACCENB.
*/
#define LMU0_RGNACCENWB13 (LMU0_RGN13_ACCENB)

/** \brief 130, LMU Region Lower Address Register */
#define LMU0_RGN14_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100130u)
/** Alias (User Manual Name) for LMU0_RGN14_LA.
* To use register names with standard convension, please use LMU0_RGN14_LA.
*/
#define LMU0_RGNLA14 (LMU0_RGN14_LA)

/** \brief 134, LMU Region Upper Address Register */
#define LMU0_RGN14_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100134u)
/** Alias (User Manual Name) for LMU0_RGN14_UA.
* To use register names with standard convension, please use LMU0_RGN14_UA.
*/
#define LMU0_RGNUA14 (LMU0_RGN14_UA)

/** \brief 138, LMU Region Write Access Enable Register A */
#define LMU0_RGN14_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100138u)
/** Alias (User Manual Name) for LMU0_RGN14_ACCENA.
* To use register names with standard convension, please use LMU0_RGN14_ACCENA.
*/
#define LMU0_RGNACCENWA14 (LMU0_RGN14_ACCENA)

/** \brief 13C, LMU Region Write Access Enable Register B */
#define LMU0_RGN14_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810013Cu)
/** Alias (User Manual Name) for LMU0_RGN14_ACCENB.
* To use register names with standard convension, please use LMU0_RGN14_ACCENB.
*/
#define LMU0_RGNACCENWB14 (LMU0_RGN14_ACCENB)

/** \brief 140, LMU Region Lower Address Register */
#define LMU0_RGN15_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100140u)
/** Alias (User Manual Name) for LMU0_RGN15_LA.
* To use register names with standard convension, please use LMU0_RGN15_LA.
*/
#define LMU0_RGNLA15 (LMU0_RGN15_LA)

/** \brief 144, LMU Region Upper Address Register */
#define LMU0_RGN15_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100144u)
/** Alias (User Manual Name) for LMU0_RGN15_UA.
* To use register names with standard convension, please use LMU0_RGN15_UA.
*/
#define LMU0_RGNUA15 (LMU0_RGN15_UA)

/** \brief 148, LMU Region Write Access Enable Register A */
#define LMU0_RGN15_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100148u)
/** Alias (User Manual Name) for LMU0_RGN15_ACCENA.
* To use register names with standard convension, please use LMU0_RGN15_ACCENA.
*/
#define LMU0_RGNACCENWA15 (LMU0_RGN15_ACCENA)

