Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxLmu_reg.h
/** \brief 1DC, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN8_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81001DCu)
/** Alias (User Manual Name) for LMU0_RGNACCEN8_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN8_RB.
*/
#define LMU0_RGNACCENRB8 (LMU0_RGNACCEN8_RB)

/** \brief 1E8, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN9_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81001E8u)
/** Alias (User Manual Name) for LMU0_RGNACCEN9_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN9_RA.
*/
#define LMU0_RGNACCENRA9 (LMU0_RGNACCEN9_RA)

/** \brief 1EC, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN9_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81001ECu)
/** Alias (User Manual Name) for LMU0_RGNACCEN9_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN9_RB.
*/
#define LMU0_RGNACCENRB9 (LMU0_RGNACCEN9_RB)

/** \brief 1F8, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN10_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81001F8u)
/** Alias (User Manual Name) for LMU0_RGNACCEN10_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN10_RA.
*/
#define LMU0_RGNACCENRA10 (LMU0_RGNACCEN10_RA)

/** \brief 1FC, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN10_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81001FCu)
/** Alias (User Manual Name) for LMU0_RGNACCEN10_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN10_RB.
*/
#define LMU0_RGNACCENRB10 (LMU0_RGNACCEN10_RB)

/** \brief 208, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN11_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100208u)
/** Alias (User Manual Name) for LMU0_RGNACCEN11_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN11_RA.
*/
#define LMU0_RGNACCENRA11 (LMU0_RGNACCEN11_RA)

/** \brief 20C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN11_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810020Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN11_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN11_RB.
*/
#define LMU0_RGNACCENRB11 (LMU0_RGNACCEN11_RB)

/** \brief 218, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN12_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100218u)
/** Alias (User Manual Name) for LMU0_RGNACCEN12_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN12_RA.
*/
#define LMU0_RGNACCENRA12 (LMU0_RGNACCEN12_RA)

/** \brief 21C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN12_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810021Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN12_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN12_RB.
*/
#define LMU0_RGNACCENRB12 (LMU0_RGNACCEN12_RB)

/** \brief 228, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN13_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100228u)
/** Alias (User Manual Name) for LMU0_RGNACCEN13_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN13_RA.
*/
#define LMU0_RGNACCENRA13 (LMU0_RGNACCEN13_RA)

/** \brief 22C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN13_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810022Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN13_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN13_RB.
*/
#define LMU0_RGNACCENRB13 (LMU0_RGNACCEN13_RB)

/** \brief 238, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN14_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100238u)
/** Alias (User Manual Name) for LMU0_RGNACCEN14_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN14_RA.
*/
#define LMU0_RGNACCENRA14 (LMU0_RGNACCEN14_RA)

/** \brief 23C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN14_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810023Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN14_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN14_RB.
*/
#define LMU0_RGNACCENRB14 (LMU0_RGNACCEN14_RB)

/** \brief 248, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN15_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100248u)
/** Alias (User Manual Name) for LMU0_RGNACCEN15_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN15_RA.
*/
#define LMU0_RGNACCENRA15 (LMU0_RGNACCEN15_RA)

/** \brief 24C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN15_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810024Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN15_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN15_RB.
*/
#define LMU0_RGNACCENRB15 (LMU0_RGNACCEN15_RB)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXLMU_REG_H */
